tap "datawire/blackbird"
tap "homebrew/bundle"
tap "epk/epk"

# Essentials
brew "git"
brew "lazygit"
brew "fzf"
brew "zoxide"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "eza"
brew "nmap"
brew "htop"
brew "tldr"
brew "watch"
brew "tree"
brew "wget"
brew "tmux"
brew "chezmoi"

cask "iterm2"
cask "alacritty"
cask "amethyst"
cask "numi"
cask "keka"
cask "firefox"
cask "raycast"
cask "shottr"
cask "kindle"
cask "calibre"
cask "viscosity"
cask "google-chrome"
cask "monitorcontrol"
cask "logi-options-plus"
cask "font-hack-nerd-font"
cask "font-sf-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "nikitabobko/tap/aerospace"


# DEV 

## IDE
brew "neovim"
brew "ripgrep"

cask "clion"
cask "intellij-idea"
cask "visual-studio-code"

## Managers
brew "node"
brew "maven"

## Languages
brew "go"
brew "rustup-init"

## Tools
brew "gh"
brew "hugo"
cask "postman"
brew "plantuml"
brew "graphviz"

cask "ngrok"
cask "docker"

## k8s
brew "k9s"
brew "helm"
brew "kubernetes-cli"
brew "datawire/blackbird/telepresence-arm64"

## Environments
brew "nvm"

## INFRA
brew "tfenv"
brew "tgenv"


## Video tools
brew "srt"
brew "bento4"
brew "ffmpeg"
brew "tsduck"
brew "opencv"
brew "gstreamer"
brew "qrencode"

cask "vlc"
